# **Handling missing values using Pandas**

#### Import libraries

In [5]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

### Loading dataset.

In [6]:
df = sns.load_dataset("titanic")

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Checking the missing values in each column.

In [8]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### missing values in `age` columns.

In [9]:
print(df['age'].isnull().sum())

177

### **Finding mean of the `age` column.**

In [10]:
mean = df['age'].mean() 
print(round(mean , 3))

29.699

### By using the `fillna()` function in the pandas, we can fill null values with the mean , median etc.

In [11]:
df['age'] = df['age'].fillna(mean)

## We have suucessfully imputed the null values in the `age` column.

In [12]:
print(df['age'].isnull().sum())

0

In [13]:
median = df['age'].median() 
print(round(mean , 3))

29.699

### **Here we can do the same by the median of the column.**

In [14]:
df['age'] = df['age'].fillna(mean)

## **If there are large number of null values you can simply remove that column.**

In [15]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## **Now that the `deck` columns ahs alot of null values we can remove the whole column.***

In [17]:
df.drop( columns = ['deck'] , inplace= True)

In [18]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

## **See we have successfully remove the deck column from the dataFrame**